Brasserie-Corto/Corto-Densimeter/Espressif/sdkconfig.defaults
# Default sdkconfig parameters to use the OTA
# partition table layout, with a 4MB flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Use custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Définir la cible ESP32-C6
CONFIG_IDF_TARGET="esp32c6"

# WiFi configuration pour compatibilité Freebox Pop
# Désactiver WiFi stats qui peuvent causer des problèmes
CONFIG_ESP_WIFI_ENABLE_WIFI_RX_STATS=n
CONFIG_ESP_WIFI_ENABLE_WIFI_TX_STATS=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Configuration HTTPS / TLS
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_DEFAULT_CERTIFICATE_BUNDLE=y